; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world: modified for Slaney's BWSTATES generator
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain blocksworld)
  (:requirements :strips :typing)
  (:types block)
  (:predicates (on ?x - block ?y - block)
	       (on-table ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (on-table ?x) (handempty))
	     :effect
	     (and (not (on-table ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (on-table ?x)))
  (:action stack
	     :parameters (?x - block ?y - block)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x - block ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem BW-3-9804-5)
    (:domain blocksworld)
    (:objects b1 b2 b3 - block)
    (:init
        (handempty)
        (on b1 b2)
        (on b2 b3)
        (on-table b3)
        (clear b1)
    )
    (:goal
        (and
            (on b1 b2)
            (on-table b2)
            (on-table b3)
        )
    )
)

; plan
1. (unstack b1 b2)
   deleted: (clear b1) (handempty) (on b1 b2)
   added: (holding b1) (clear b2)
   goals met: 1 of 3
2. (put-down b1)
   deleted: (holding b1)
   added: (clear b1) (handempty) (on-table b1)
   goals met: 1 of 3
3. (unstack b2 b3)
   deleted: (clear b2) (handempty) (on b2 b3)
   added: (holding b2) (clear b3)
   goals met: 1 of 3
4. (put-down b2)
   deleted: (holding b2)
   added: (clear b2) (handempty) (on-table b2)
   goals met: 2 of 3
5. (pick-up b1)
   deleted: (on-table b1) (clear b1) (handempty)
   added: (holding b1)
   goals met: 2 of 3
6. (stack b1 b2)
   deleted: (holding b1) (clear b2)
   added: (clear b1) (handempty) (on b1 b2)
   goals met: 3 of 3
